IDEA Open Model
StrainImpulse Structure
Compatible with IDEA StatiCa Beta 20.0
 Generalized strain load impulse.
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public struct StrainImpulse
Public Structure StrainImpulse
The StrainImpulse type exposes the following members.
Properties
Name | Description
EpsX
 The normal strain.
GammaXY
 The shear strain.
GammaXZ
 The shear strain.
PhiX
 The torsion slope around x axis.
PhiY
 The curvature around z axis.
PhiZ
 The curvature around y axis.
Top
See Also
Reference
IdeaRS.OpenModel.Loading Namespace